{
    "msg": "Data found.",
    "status": true,
    "data": [
        {
            "title": "Gus Atkinson 'Greedy' for More Milestones After Hat-Trick Sends New Zealand Reeling",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/957591340_news.webp",
            "description": "Gus Atkinson has expressed his hunger for more milestones after taking England’s 15th Test hat-trick on day two of the second Test against New Zealand...",
            "content": [
                "<p>Gus Atkinson has expressed his hunger for more milestones after taking England&rsquo;s 15th Test hat-trick on day two of the second Test against New Zealand at the Basin Reserve, leaving the hosts in deep trouble.<\/p>\r\n\r\n<p>Atkinson, who became the 14th Englishman to achieve the feat, is now also the 50th player&mdash;man or woman&mdash;to claim a Test hat-trick. He follows in the footsteps of Stuart Broad, who has achieved the feat twice, and Moeen Ali, the last Englishman to take a hat-trick in Test cricket, against South Africa in 2017.<\/p>\r\n\r\n<p>The stunning hat-trick came at a pivotal moment as New Zealand were bowled out for just 125, 155 runs behind England&#39;s first-innings total of 280. Atkinson&rsquo;s efforts&mdash;removing Nathan Smith, Matt Henry, and Tim Southee in three successive balls&mdash;wrapped up New Zealand&rsquo;s innings and left England with a commanding lead of 533 runs, with the tourists closing day two at 378 for 5 in their first innings.<\/p>\r\n\r\n<p>Atkinson&rsquo;s hat-trick was a testament to his growing Test career, which already includes a debut to remember. On his debut in July at Lord&rsquo;s, he claimed 12 wickets against the West Indies, including figures of 7 for 45 and 5 for 61. He then returned to Lord&rsquo;s for another five-wicket haul, this time against Sri Lanka, before scoring a maiden Test century. The 26-year-old has quickly established himself as one of England&#39;s most promising fast bowlers.<\/p>\r\n\r\n<p>Despite the achievement, Atkinson is not resting on his laurels. Reflecting on his hat-trick, Atkinson said, &ldquo;You always want to get more and be greedy. You want to take as many as you can and that&rsquo;s something I want to try and do in the future.&quot;<\/p>\r\n\r\n<p>The hat-trick ball itself was a calculated risk. Atkinson, knowing that New Zealand&rsquo;s tailender Southee is prone to aggressive shots, set a short-ball field before surprising him with a full delivery that struck him on the pad. &ldquo;I was thinking about bowling a yorker, getting it full and straight. I missed a bit but thankfully it still ended up straight and relatively full when it hit him on the pad,&rdquo; Atkinson explained.<\/p>\r\n\r\n<p>Before this, Atkinson had a chance at a hat-trick on debut when he removed two West Indies batsmen in successive deliveries. However, his third ball in that instance was blocked, and the West Indies&rsquo; Joshua Da Silva was dismissed by the very next ball.<\/p>\r\n\r\n<p>Atkinson&rsquo;s hat-trick was part of an extraordinary year for the fast bowler. His rapid rise to Test cricket, having played only 19 first-class matches before being selected, has been helped by the support of captain Ben Stokes and coach Brendon McCullum, who have given him the freedom to thrive. Atkinson currently boasts 47 Test wickets at an average of 21.31, an impressive return for just 10 matches.<\/p>\r\n\r\n<p>Looking ahead, Atkinson is eager to keep up his momentum and help England win the series. He credited the environment created by McCullum and Stokes for allowing players to express themselves without pressure. &ldquo;There&rsquo;s no pressure on any of us. It&rsquo;s just to go out and play our natural game,&rdquo; said Atkinson.<\/p>\r\n\r\n<p>In addition to his own success, Atkinson also praised the performance of young batter Jacob Bethell, who scored a career-best 96 in the first innings of the match. Bethell, just 21 years old, has impressed since joining the team and was part of a brilliant 187-run partnership with Ben Duckett, who also narrowly missed out on a century, falling for 92.<\/p>\r\n\r\n<p>Atkinson&rsquo;s commitment to his personal development and his desire for further achievements suggest that the future holds many more milestones for the young fast bowler. As England continues to dominate in New Zealand, Atkinson&rsquo;s hunger for success is a promising sign of things to come.<\/p>\r\n"
            ],
            "pub_date": "07 Dec, 2024 | 01:58 PM",
            "news_id": 1498
        },
        {
            "title": "John Campbell Suspended for Four Matches Following Super50 Final No-Show",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1450522977_news.webp",
            "description": "Jamaica Scorpions captain John Campbell has been handed a four-match suspension for failing to appear for the toss ahead of the Super50...",
            "content": [
                "<p>Jamaica Scorpions captain John Campbell has been handed a four-match suspension for failing to appear for the toss ahead of the Super50 final against Barbados Pride, which led to the match being forfeited for the 2024-25 season. In a statement from Cricket West Indies (CWI), Campbell expressed his regret for the incident.<\/p>\r\n\r\n<p>&quot;I sincerely regret any disruption caused during the final and acknowledge that my actions may have been perceived as resistance to the match officials&#39; decision,&quot; Campbell said. &quot;It was never my intention to undermine their authority or bring the game into disrepute. I fully acknowledge the importance of maintaining the integrity of the game and the need for adherence to the rules and decisions of the officials.&quot;<\/p>\r\n\r\n<p>The Super50 final was forfeited under unusual circumstances when neither captain appeared for the toss in a rain-affected match. Although the umpires deemed the conditions suitable for a 20-overs-a-side contest, the absence of both captains meant no match took place, and no trophy was awarded for the 2024-25 edition.<\/p>\r\n\r\n<p>The disciplinary fate of Barbados captain Raymon Reifer, who faces similar charges, remains undecided. He has not yet responded to the charges, which were brought by match referee Reon King.<\/p>\r\n\r\n<p>CWI director of cricket Miles Bascombe expressed appreciation for Campbell&rsquo;s acknowledgment of the situation and his apology. &quot;In light of his admission and demonstrated remorse, CWI has applied the minimum sanction of a four-match ban for a Level 3 Offence, as a matter of leniency,&quot; Bascombe said.<\/p>\r\n\r\n<p>&quot;This decision reinforces the critical role of captains in upholding the values of sportsmanship and respect for the game&#39;s integrity,&quot; he added. &quot;We trust that John will use this experience to continue contributing positively to West Indies cricket and serve as a role model moving forward.&quot;<\/p>\r\n\r\n<p>CWI also confirmed that no match fees would be paid for the final, and no prize money would be awarded to the winners or runners-up of the tournament.<\/p>\r\n"
            ],
            "pub_date": "07 Dec, 2024 | 11:42 AM",
            "news_id": 1497
        },
        {
            "title": "Rangpur Wins Global Super League Final Amid Uncertainty Over Three Players' Participation",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/832561923_news.webp",
            "description": "angpur Riders have clinched the Global Super League (GSL) title, defeating Victoria by 56 runs in the final...",
            "content": [
                "<p>Rangpur Riders have clinched the Global Super League (GSL) title, defeating Victoria by 56 runs in the final, despite last-minute uncertainty surrounding the availability of three of their players.<\/p>\r\n\r\n<p>The confusion arose when the Bangladesh Cricket Board (BCB) initially requested that Rangpur release three Bangladesh players &ndash; Rishad Hossain, Afif Hossain, and Soumya Sarkar &ndash; from the competition. The final match was scheduled for December 6 in Providence, Guyana, just two days before Bangladesh&#39;s ODI series opener against the West Indies in St Kitts on December 8. Rangpur had already reached the final after overcoming Lahore Qalandars in a thrilling match. However, with Afif, Rishad, and Soumya also named in the Bangladesh ODI squad, their participation in the final was uncertain.<\/p>\r\n\r\n<p>Afif had received a No Objection Certificate (NOC) from the BCB until December 7, making him eligible to play. However, the NOCs for Soumya and Rishad had expired, and the BCB rejected Rangpur&#39;s request for an extension. With hours to go before the final, Rangpur were in a tense standoff with the BCB, attempting to contact president Faruque Ahmed, who was traveling to New York.<\/p>\r\n\r\n<p>Despite the confusion, the match went ahead as scheduled. Rangpur posted a solid 178\/3, thanks to a superb 86 off 54 balls from Soumya and 68 from 49 balls by Steven Taylor. Victoria, in response, could only manage 122 all out in 18.1 overs.<\/p>\r\n\r\n<p>Earlier, Rangpur had expressed concerns that they might be forced to forfeit the final if the BCB maintained their stance. They warned that such a scenario could damage the reputation of Bangladesh cricket internationally, as it is rare for a team to miss a final due to player shortages. Rangpur emphasized that they were not just representing their franchise, but the entire nation of Bangladesh, making the situation all the more crucial for cricket fans.<\/p>\r\n\r\n<p>In the lead-up to the final, the GSL had rescheduled the match to December 6 to avoid a clash with the Bangladesh-West Indies ODI series. Rangpur were already without Khushdil Shah, whose NOC from the Pakistan Cricket Board had expired, and Matthew Forde, who was unavailable due to injury.<\/p>\r\n"
            ],
            "pub_date": "07 Dec, 2024 | 11:40 AM",
            "news_id": 1496
        },
        {
            "title": "Brook's Century Rescues England After New Zealand's Strong Start",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1842873801_news.webp",
            "description": "England's reliance on Harry Brook continued as his second consecutive Test century rescued them from a challenging...",
            "content": [
                "<p>England&#39;s reliance on Harry Brook continued as his second consecutive Test century rescued them from a challenging position at Basin Reserve. Brook, alongside Ollie Pope, reversed the momentum with a dynamic 174-run partnership, averaging over a run a ball, after Matt Henry&#39;s outstanding new-ball spell reduced England to 43 for 4.<\/p>\r\n\r\n<p>Brook&#39;s 100 came off just 91 balls, making it his second-fastest Test century and his eighth overall. Although he was frequently beaten, the pitch provided ample assistance for the seamers, but Brook continued to play with freedom, hitting 11 fours and five sixes before being run out in an attempt for a single off Nathan Smith, who broke the stumps with a direct hit.<\/p>\r\n\r\n<p>Pope also played well, contributing his second half-century of the series after England&#39;s top order had collapsed. He started the afternoon session confidently, driving Smith for a four, but was eventually dismissed by Will O&#39;Rourke&#39;s extra bounce, top-edging a pull shot. O&#39;Rourke struck again shortly after, removing Ben Stokes with a delivery that pinned him to the crease before he was caught at second slip. This left England at 222 for 6, but Brook found another solid partner in Chris Woakes, and they steadied the innings until Smith broke the stand.<\/p>\r\n\r\n<p>New Zealand had initially taken control, with England struggling at 43 for 4 after just the first hour of play. Henry was superb with the new ball, taking two early wickets and at one point boasting figures of 4-4-0-2. Smith also made crucial breakthroughs, leaving England reeling before Brook and Pope&#39;s partnership provided much-needed resistance.<\/p>\r\n\r\n<p>Despite New Zealand&#39;s solid catching performance&mdash;following eight drops in the previous match&mdash;Brook and Pope turned the tide with an aggressive stand, amassing 81 runs off 80 balls before lunch, as they sought to wrestle back control of the game.<\/p>\r\n\r\n<p>England&rsquo;s innings had started in tumultuous fashion. Zak Crawley hit 10 off the first over, including an impressive six off Tim Southee, but the aggressive approach quickly faced stiff opposition in New Zealand&#39;s helpful conditions. Crawley looked promising but was dismissed by Henry, who bowled a superb delivery that breached his defense and hit the stumps.<\/p>\r\n\r\n<p>Smith&#39;s introduction only made matters worse for England, with Jacob Bethell struggling against his deliveries. Root&#39;s dismissal followed shortly after, with a careless shot leading to a catch at first slip, leaving England at 26 for 3. It seemed like a repeat of Brook&#39;s previous heroics in Wellington, where England were similarly struggling, but Brook soon showed his class again.<\/p>\r\n\r\n<p>Brook&rsquo;s brilliance was on display as he struck his first boundary off Henry from his 10th ball. He continued to play positively, hitting boundaries off Smith, including a 20-run over, and cracked O&#39;Rourke for four on the second ball. With lunch approaching, Brook brought up his half-century off 47 balls, and after the break, he powered on, hitting Smith for more boundaries and completing his century&mdash;his third in four Tests against New Zealand.<\/p>\r\n"
            ],
            "pub_date": "06 Dec, 2024 | 09:58 AM",
            "news_id": 1495
        },
        {
            "title": "Rob Key: Archer's IPL Stint Will Delay Test Return",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/539249879_news.webp",
            "description": "Rob Key, England's managing director of cricket, has acknowledged that Jofra Archer's decision to participate....",
            "content": [
                "<p>Rob Key, England&#39;s managing director of cricket, has acknowledged that Jofra Archer&#39;s decision to participate in the IPL next year will delay his return to Test cricket by &quot;a couple of months.&quot; However, Key explained that the England and Wales Cricket Board (ECB) could not stop Archer from taking the opportunity to earn two years&#39; worth of wages, given the IPL&#39;s new rules.<\/p>\r\n\r\n<p>Archer, who has not played a Test since February 2021 due to ongoing back and elbow injuries, is injury-free in 2024. His chances of making a Test comeback increased this week when he signed an extension to his central contract, which runs beyond the 2025-26 Ashes. Ben Stokes also confirmed that Archer remains keen on returning to Test cricket.<\/p>\r\n\r\n<p>Initially, Key had planned for Archer to play for Sussex in the County Championship during April and May to prepare for the Test series against India in June and July. However, new IPL regulations meant that missing the mega-auction would have made Archer ineligible for the subsequent mini-auction, costing him financially.<\/p>\r\n\r\n<p>Archer was originally on the IPL&rsquo;s longlist of players for the auction but did not feature on the shortlist as the ECB cited injury concerns. After some back-and-forth with the Board of Control for Cricket in India (BCCI), Archer was added to the shortlist and was eventually bought by Rajasthan Royals for INR 12.5 crore (&pound;1.18m) following a bidding war with Mumbai Indians.<\/p>\r\n\r\n<p>Key said in an interview, &ldquo;We thought the best option might be to miss the IPL and get ready for Test cricket. But the IPL&#39;s rules meant we had to consider Archer&rsquo;s career and financial future. If he missed out, he could lose around $4 million, so we left the decision to him. He chose to go into the IPL to help with his workload, and we supported that.&rdquo;<\/p>\r\n\r\n<p>Key emphasized that Archer could still play a significant role for England in the future, although he will not automatically be selected. &quot;The plan is for him to be ready to play, but he has to prove he can sustain his form over a whole Test match. We have some very good bowlers, so it&rsquo;s not guaranteed that he&rsquo;ll return immediately,&rdquo; Key added.<\/p>\r\n\r\n<p>Key also expressed concerns about the impact of lucrative franchise deals on England players. He fears that if franchise cricket offers England players year-round contracts, they may opt out of central contracts, which could negatively impact the national team. &quot;If a player gets signed for $2 million to play year-round, we might not see them for England,&quot; he explained. &quot;These franchise owners won&rsquo;t allow players to bowl 20 overs a day in a Test match after paying them that amount.&quot;<\/p>\r\n\r\n<p>Despite these concerns, Key remains hopeful about Archer&rsquo;s future and believes he still has the potential to be one of the best bowlers England has ever had.<\/p>\r\n"
            ],
            "pub_date": "06 Dec, 2024 | 09:56 AM",
            "news_id": 1494
        },
        {
            "title": "Joe Burns Appointed Italy's New Cricket Captain",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1907213226_news.webp",
            "description": "Former Australia Test opener Joe Burns has been named the new captain of the Italian national cricket team...",
            "content": [
                "<p>Former Australia Test opener Joe Burns has been named the new captain of the Italian national cricket team. Burns, born in Brisbane, switched his international allegiance to Italy in May 2024, qualifying through his mother&#39;s Italian heritage. He made his debut for Italy in June of the same year.<\/p>\r\n\r\n<p>Burns expressed his pride in taking on the leadership role, stating, &quot;I am honoured to take on this role and represent Italy on the international stage. For me, it is a return to my family&#39;s roots. Italian cricket has enormous potential and I am excited to contribute to its growth. Together with my teammates, we are working to achieve ambitious goals and make our fans proud.&quot;<\/p>\r\n\r\n<p>Fabio Marabini, the president of the Italian Cricket Federation, endorsed Burns&#39; appointment, highlighting his generosity, professionalism, and competitive spirit. &quot;Since day one, Joe has shown great generosity and professionalism, putting his experience and competitive spirit at the disposal of the team,&quot; Marabini said. &quot;His choice as captain reflects our ambition to take Italian cricket to new levels. We are also counting on his leadership to play a leading role in the next qualifying stages for the 2026 T20 World Cup.&quot;<\/p>\r\n\r\n<p>Burns, who has represented Italy in five T20Is, has been in excellent form, scoring 211 runs at an average of 70.33 and a strike rate of 144.52. His most recent performance was an unbeaten 108 off 55 balls, which led Italy to victory over Romania in the ICC Men&#39;s T20 World Cup Sub Regional Europe Qualifier Group A.<\/p>\r\n\r\n<p>Apart from his international commitments, Burns has also gained attention from franchise T20 leagues. He was signed by Dubai Capitals for the upcoming season of the UAE&#39;s ILT20 and has previously played in the Big Bash League and the Vitality Blast.<\/p>\r\n\r\n<p>As an Australia Test opener, Burns scored 1442 runs from 40 innings over 23 matches, including four centuries, between December 2014 and December 2020, at an average of 36.97.<\/p>\r\n\r\n<p>Italy&#39;s rise on the international cricket stage has also been bolstered by Burns&#39; teammate, Thomas Draca, who made the long list for the 2025 IPL player auction, though he did not make the final cut.<\/p>\r\n"
            ],
            "pub_date": "06 Dec, 2024 | 09:55 AM",
            "news_id": 1493
        },
        {
            "title": "Zimbabwe Stuns Pakistan with Thrilling Two-Wicket Victory in Bulawayo",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1759711472_news.webp",
            "description": "In a dramatic turn of events, Zimbabwe's cricket team emerged victorious in a nail-biting clash against Pakistan...",
            "content": [
                "<p>Bulawayo, Zimbabwe &ndash; In a dramatic turn of events, Zimbabwe&#39;s cricket team emerged victorious in a nail-biting clash against Pakistan, sealing a two-wicket win in a thrilling encounter that kept fans on the edge of their seats. The match, which took place on Tuesday, saw Zimbabwe fighting back after a heart-pounding, roller-coaster finish that will resonate long after the final ball.<\/p>\r\n\r\n<p>Pakistan, having been restricted to just 132 for 7, could not hold off Zimbabwe&rsquo;s spirited chase, which was far from straightforward. Zimbabwe&rsquo;s bowlers had earlier made crucial breakthroughs, with Blessing Muzarabani leading the charge with 2 for 25. Tendai Chatara and the ever-reliable Richard Ngarava contributed with important wickets, but Pakistan&#39;s Agha Salim (32) had given them a fighting chance, ensuring the total was still defendable.<\/p>\r\n\r\n<p>The Zimbabwean reply started with hesitation. Despite a gutsy 43 from their top-scorer, Ryan Bennett, and a resilient fight from their lower order, the team faced a tense chase with wickets falling at crucial moments. A fine spell from Pakistan&rsquo;s Abbas Afridi, who picked up 3 for 24, added to Zimbabwe&rsquo;s mounting pressure, leaving the home side at 133 for 8, just two wickets away from defeat.<\/p>\r\n\r\n<p>In the final over, with victory still within reach, the tension reached its peak. A fumbled throw from Pakistan&rsquo;s fielders and a crucial hesitation from Zimbabwe&rsquo;s Richard Ngarava at the non-striker&#39;s end made for a moment of pure drama. However, a quick-thinking Ngarava scampered through for a single off the penultimate delivery, stealing the win and leaving the packed crowd in Bulawayo in ecstatic disbelief.<\/p>\r\n\r\n<p>Although Zimbabwe&#39;s 2-1 series defeat to Pakistan will be recorded in the history books, this victory will be remembered for its thrilling climax and the team&#39;s resilience under pressure. For Zimbabwe, it was more than just a consolation win &ndash; it was a statement of their fighting spirit and determination, especially on home soil.<\/p>\r\n"
            ],
            "pub_date": "05 Dec, 2024 | 08:59 PM",
            "news_id": 1492
        },
        {
            "title": "Pat Cummins Expects Marnus Labuschagne to Be More Proactive as Australia Prepares for Adelaide Test",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1116903831_news.webp",
            "description": "Pat Cummins is confident that Marnus Labuschagne will bring a more proactive approach to his batting in the upcoming Test...",
            "content": [
                "<p>Pat Cummins is confident that Marnus Labuschagne will bring a more proactive approach to his batting in the upcoming Test against India in Adelaide, as the Australian No. 3 searches for a revival of form. Labuschagne has been under heavy scrutiny following a difficult performance in Perth, where he scored just 2 from 52 balls in the first innings and was dismissed for 3 in the second, caught in front by Jasprit Bumrah. Despite criticism, analysis of his dismissal by Bumrah suggests it was a wicked delivery that skidded low, and Labuschagne was justified in expecting it to miss the stumps.<\/p>\r\n\r\n<p>However, his overall form has been troubling for some time. Of the 123 runs he has accumulated in his last 10 Tests, 90 came from a single innings in Christchurch. In response, Labuschagne has shown signs of urgency in his stroke play during Adelaide net sessions, with a visible effort to rotate the strike more effectively. The 29-year-old has an impressive record at Adelaide Oval, averaging 71.75 with three centuries, and Cummins believes this could be the venue where he rediscovers his best form.<\/p>\r\n\r\n<p>&quot;He&#39;s training well like he always does, hitting millions of balls,&quot; Cummins said. &quot;It&#39;s pretty impossible to dismiss or ignore some of the commentary about perhaps being a little bit more proactive, so I think you&#39;ve seen that side of it in the nets. The challenge is always going out there and making sure you have that mindset. But he&#39;s been great like he always is. Always working on things, trying to plan how he&#39;s going to score his hundred this Test.&quot;<\/p>\r\n\r\n<p>Despite the team&#39;s disappointing performance in Perth, Cummins is optimistic that Australia&#39;s batters will benefit from their encounters with the Indian attack, particularly Bumrah. &quot;I hope there&#39;s some lessons learnt,&quot; he said. &quot;The good thing is, batting and bowling we&#39;ve now had a look at them, they&#39;ve had a look at us as well...I&#39;m sure everyone&#39;s kind of learnt a bit and come back here slightly better prepared.&quot;<\/p>\r\n\r\n<p>In terms of team changes, Australia has confirmed that Mitchell Marsh will retain his place in the XI, with Scott Boland replacing the injured Josh Hazlewood. Cummins revealed that Marsh has been struggling with back stiffness since the UK white-ball tour, but he is confident the allrounder will be able to contribute with the ball despite not bowling in the lead-up to the Test.<\/p>\r\n\r\n<p>&ldquo;[We] made the call with the medical staff over the last couple of days to give him a couple of days off bowling, but expect him to warm up and if required [he] will bowl,&rdquo; Cummins said. &ldquo;Guessing he would be required at some point&hellip; prioritise his overs for the games rather than kind of using up some of them in the nets.&rdquo;<\/p>\r\n\r\n<p>Although Labuschagne was used as a bowler in Perth&mdash;bowling bouncers and later returning to leg-spin&mdash;Cummins indicated that any extra overs needed in Adelaide would likely be bowled by the four main fast bowlers, especially if Marsh&#39;s bowling workload is limited.<\/p>\r\n\r\n<p>&quot;I&#39;d say more likely turn to the fast bowlers a bit more,&quot; said Cummins. &quot;In Perth, Joshy was getting a little bit sore as well there towards the end, so there&#39;s a bit of preservation there. Whereas this Test everyone&#39;s fit and firing, so if that remains the case as a general rule you try and rely on your four main guys.&quot;<\/p>\r\n\r\n<p>Cummins also praised Boland&rsquo;s ability to bowl long spells, with the Victorian set to make his first appearance in the Test side since last year&#39;s Ashes. &quot;All last summer he was geared up to go and no one fell over,&quot; Cummins noted. &quot;Feels like it&#39;s been quite a while [since he&#39;s played]. As a captain, it&#39;s pretty awesome to have someone like Scotty come straight in, you know he can bowl a huge amount of overs if you need. He&#39;s super consistent, he&#39;s performed at this level and looks ready to go.&quot;<\/p>\r\n\r\n<p>Looking ahead, Cummins revealed that Hazlewood could be ready to return for the third Test in Brisbane, after bowling during training. Hazlewood had initially continued to bowl after experiencing side discomfort in Perth, but the decision was made to rest him to avoid aggravating the issue.<\/p>\r\n\r\n<p>&quot;That&#39;s probably the right call in hindsight,&quot; said Cummins. &quot;I think in previous years where he&#39;s kept bowling, it&#39;s probably turned that one-week injury into a three or four or five-week injury whereas this year seems a little bit different and he&#39;s really confident.&quot;<\/p>\r\n"
            ],
            "pub_date": "05 Dec, 2024 | 02:06 PM",
            "news_id": 1491
        },
        {
            "title": "New Zealand Eye Another Fightback at Scene of Epic One-Run Win",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1964640602_news.webp",
            "description": "The last Test between New Zealand and England at Wellington, 21 months ago, remains unforgettable...",
            "content": [
                "<p>The last Test between New Zealand and England at Wellington, 21 months ago, remains unforgettable. A packed Basin Reserve witnessed one of the most extraordinary finishes in Test cricket history, with New Zealand clinching a thrilling one-run victory. Even England&#39;s James Anderson, defeated in a bizarre finish after gloving a Neil Wagner bumper, couldn&#39;t help but smile at the absurdity of it all. It was an incredible example of the best&mdash;and the worst&mdash;of Bazball: committed attacking cricket that, at times, went too far, as evidenced by England&#39;s unnecessary follow-on decision that allowed New Zealand to stay in the game.<\/p>\r\n\r\n<p>In the aftermath, England&#39;s captain Ben Stokes reflected on the loss: &quot;We look at the bigger picture of what everyone&#39;s enjoyed and seen here today... it&#39;s probably bigger than the disappointment at the moment.&quot; Since then, however, England&rsquo;s fortunes have been mixed, with a string of defeats in winning positions, including two losses in the 2023 Ashes. Yet their victory in last week&rsquo;s first Test at Christchurch marked a welcome turn, with Stokes now channeling his frustrations into criticisms of the ICC&#39;s over-rate adjudicators rather than letting them affect his team&rsquo;s focus.<\/p>\r\n\r\n<p>For New Zealand, the question lingers: what if they had held onto their chances in Christchurch? Eight dropped catches in England&rsquo;s first innings made a huge difference, particularly with five of those coming off the bat of Harry Brook, who went on to score 171 runs despite the reprieves. His performance continued a remarkable record in New Zealand, where he now has 500 runs at an average of 100. Brook&rsquo;s remarkable first-innings knock of 186 in Wellington last year was also pivotal, as England had been reduced to 21 for 3 before Brook&#39;s dominance. Had the weather not interrupted, he likely would have surpassed 200, and who knows, maybe a triple-century in Multan wouldn&rsquo;t have been his first.<\/p>\r\n\r\n<p>Despite New Zealand&#39;s shortcomings in Christchurch, such as poor fielding and inconsistent batting, there are encouraging signs. Kane Williamson&rsquo;s return from a groin strain has been a major positive. However, Devon Conway&rsquo;s form remains a worry, with an average of just 21.10 in the past 12 months, and Tom Blundell&rsquo;s struggles are even more concerning&mdash;he&rsquo;s managed just one fifty in 25 innings since his vital 90 in Wellington. Tim Southee, nearing the end of his illustrious Test career, was the weak link in Christchurch, though he did show glimpses of his class with some key moments early in England&rsquo;s first innings.<\/p>\r\n\r\n<p>New Zealand&rsquo;s best chance to fight back in this series lies in exploiting England&rsquo;s weaknesses with the moving ball, especially on pitches that offer seam and swing. If they can find a good length and make the ball talk, they might have a way back into the series.<\/p>\r\n\r\n<p><strong>Form Guide:<\/strong><\/p>\r\n\r\n<ul>\r\n\t<li><strong>New Zealand:<\/strong> LWWWL (last five Tests, most recent first)<\/li>\r\n\t<li><strong>England:<\/strong> WLLWL<\/li>\r\n<\/ul>\r\n\r\n<p><strong>In the Spotlight: Brydon Carse and Will O&#39;Rourke<\/strong><\/p>\r\n\r\n<p>Brydon Carse&rsquo;s ten-wicket haul at Christchurch confirmed his status as a rising star for England. His pace, aggression, and accuracy were key in dismantling New Zealand&rsquo;s batting, and his match figures of 10 for 106 were remarkable. This performance capped off a strong winter tour for Carse, who has bounced back strongly after a summer sidelined by a betting ban.<\/p>\r\n\r\n<p>Will O&#39;Rourke, though not as tall as the absent Kyle Jamieson, impressed with his sharp pace in Christchurch, regularly touching speeds over 145 kph. Unfortunately, he was unlucky with the catch drops, which marred his figures of 2 for 165. Despite the runs flowing in, O&#39;Rourke&#39;s pace and bounce troubled England&rsquo;s batters, and he deserves better returns on the green Wellington pitch.<\/p>\r\n\r\n<p><strong>Team News: Both Sides Unchanged<\/strong><\/p>\r\n\r\n<p>New Zealand are sticking with the same XI for the second Test, with captain Tom Latham expressing confidence in their approach despite the loss in Christchurch. The team will need more consistent batting performances, especially from Conway and Blundell, while Southee will need to find his best form as he approaches the end of his Test career.<\/p>\r\n\r\n<p><strong>New Zealand XI:<\/strong><\/p>\r\n\r\n<ol>\r\n\t<li>Tom Latham (capt), 2. Devon Conway, 3. Kane Williamson, 4. Rachin Ravindra, 5. Daryl Mitchell, 6. Tom Blundell (wk), 7. Glenn Phillips, 8. Nathan Smith, 9. Tim Southee, 10. Matt Henry, 11. Will O&#39;Rourke<\/li>\r\n<\/ol>\r\n\r\n<p>England have made no changes to their XI either, with Ollie Pope continuing as wicketkeeper and Ben Stokes set to bowl after recovering from a back niggle. England&rsquo;s balance looks solid, with key performances from Pope and debutant Jacob Bethell in the first Test. They are confident in their unchanged lineup.<\/p>\r\n\r\n<p><strong>England XI:<\/strong><\/p>\r\n\r\n<ol>\r\n\t<li>Zak Crawley, 2. Ben Duckett, 3. Jacob Bethell, 4. Joe Root, 5. Harry Brook, 6. Ollie Pope (wk), 7. Ben Stokes (capt), 8. Chris Woakes, 9. Gus Atkinson, 10. Brydon Carse, 11. Shoaib Bashir<\/li>\r\n<\/ol>\r\n\r\n<p><strong>Pitch and Conditions: Another Run-Fest?<\/strong><\/p>\r\n\r\n<p>The Wellington pitch appears to be green but is unlikely to offer the same assistance to bowlers as the one in Christchurch. While Chris Woakes noted that it looks &quot;green,&quot; it&rsquo;s expected to dry out and become a batting-friendly surface. Based on past visits, it&rsquo;s likely to be a run-fest, though New Zealand will hope for enough seam movement early to trouble England&rsquo;s top order.<\/p>\r\n"
            ],
            "pub_date": "05 Dec, 2024 | 09:23 AM",
            "news_id": 1490
        },
        {
            "title": "Sri Lanka's Pace Attack Offers Hope on Gqeberha Greentop",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1834026828_news.webp",
            "description": "Sri Lanka's fast-bowling options are giving the team optimism ahead of their upcoming Test....",
            "content": [
                "<p>Sri Lanka&#39;s fast-bowling options are giving the team optimism ahead of their upcoming Test match on a green-tinged pitch in Gqeberha. With fast bowlers like Lahiru Kumara (25 wickets at 22.68 in 2024), Vishwa Fernando (24.12 average in South Africa), and Asitha Fernando (68 career wickets at 25.97), Sri Lanka&#39;s pace attack is now more formidable than ever. The team has depth, with further strong options available on the bench.<\/p>\r\n\r\n<p>Sri Lanka&#39;s fast-bowling history includes legends like Chaminda Vaas (355 Test wickets) and Lasith Malinga, who was known for his fiery spells before injuries cut his career short. However, the current group is possibly the deepest Sri Lanka has ever had. In their recent match in Durban, Sri Lanka left out Kasun Rajitha, who averages 25.00 in South Africa and is one of their tallest bowlers, as well as Milan Rathnayake, who impressed with both bat and ball in England earlier this year.<\/p>\r\n\r\n<p>Sri Lanka&#39;s captain, Dhananjaya de Silva, acknowledges the rarity of such fast-bowling depth in Sri Lanka&#39;s cricket history. &quot;I&#39;m very happy, because they know their games now, and what they need to do for the team,&quot; he said. He credited his predecessor, Dimuth Karunaratne, for developing many of these fast bowlers during his time as captain. &quot;As captain, I&#39;m able to reap those rewards, so I&#39;d like to give Dimuth aiya the credit for that,&quot; de Silva added.<\/p>\r\n\r\n<p>Sri Lanka is considering the balance of their XI for the Test in Gqeberha, with the option to pick four seamers, as they did at The Oval earlier this year, where they enjoyed success. Though the surface in Gqeberha is expected to favor fast bowlers, they may still choose to include their specialist spinner, Prabath Jayasuriya. &quot;We&#39;re still discussing how many fast bowlers we will play and will decide later,&quot; de Silva noted. &quot;The track here is quite green.&quot;<\/p>\r\n\r\n<p>Sri Lanka&#39;s pace attack gained valuable experience during their series in England, where they demonstrated they can win overseas with fast bowling. De Silva believes the loss in Durban was due to batting failures rather than the bowling, with the team being dismissed for just 40-odd runs in one innings. &quot;You can&#39;t win a Test like that,&quot; de Silva said.<\/p>\r\n\r\n<p>In 2019, during Karunaratne&#39;s first series as captain, Vishwa Fernando took four wickets in a match Sri Lanka won in Gqeberha. Kumara, another key member of the likely XI, also impressed in South Africa in his early career, famously dismissing Hashim Amla with a stunning nip-backer at Newlands. While Kumara has had some injury struggles, particularly with hamstring issues, he is expected to play on Thursday, marking his highest tally of Tests in a calendar year with seven matches in 2024.<\/p>\r\n\r\n<p>De Silva highlighted Kumara&#39;s recent consistency: &quot;Lahiru has been consistent in the last two years and has played a lot of matches. He&rsquo;d been in and out of the team because of injuries, but now he&rsquo;s been able to play consistently and learn what his strengths and weaknesses are.&quot; De Silva believes that Kumara&#39;s ability to focus on his strengths, thanks to consistent playing time, has contributed to his success.<\/p>\r\n\r\n<p>Looking ahead to the Gqeberha Test, de Silva hopes Sri Lanka&#39;s fast-bowling strategy, which he has championed, will bring rewards. Despite his role as a spinner, de Silva has been an advocate for including at least two quick bowlers, even on home turf, to be more competitive in SENA (South Africa, England, New Zealand, Australia) nations. He&rsquo;s optimistic that this approach will pay off in South Africa.<\/p>\r\n"
            ],
            "pub_date": "05 Dec, 2024 | 09:21 AM",
            "news_id": 1489
        },
        {
            "title": "Rana's Five-Fer and Aggressive Batting Put Bangladesh in Control in Jamaica Test",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1508278902_news.webp",
            "description": "Bangladesh's aggressive batting and precise fast bowling propelled them into a commanding position on...",
            "content": [
                "<p>Bangladesh&#39;s aggressive batting and precise fast bowling propelled them into a commanding position on the third day of the Jamaica Test, as they gained a 211-run lead over West Indies. At stumps, the visitors had bowled out the hosts for 146 and were 193\/5 in their second innings, showing resilience under pressure and dominating a hostile bowling attack. This marked only the second time in their history that Bangladesh had a first-innings lead after being bowled out for less than 200 runs.<\/p>\r\n\r\n<p>West Indies, who had begun the day in a strong position, faltered badly, losing their last nine wickets for just 61 runs. Nahid Rana was the star of the day for Bangladesh, claiming a maiden five-wicket haul. His figures of 5\/61 included some intimidating pace bowling and crucial breakthroughs, including a bruising spell that left West Indies&#39; Kemar Roach hurt after taking two blows to his shoulder. Roach was forced to bowl only in the 31st over of the third innings, allowing Bangladesh to avoid facing a bowler with a brilliant record against them.<\/p>\r\n\r\n<p>Rana&rsquo;s devastating morning spell continued from the previous day, using his height and pace to generate extra bounce. He removed West Indies captain Kraigg Brathwaite with a sharp delivery, which was caught by substitute Zakir Hasan at gully. Rana soon had Kavem Hodge mistiming a pull shot, which was well caught by Litton Das behind the stumps.<\/p>\r\n\r\n<p>Taskin Ahmed joined the attack by dismissing Alick Athanaze, while Taijul Islam bowled Justin Greaves through the gap between bat and pad. Mehidy Hasan Miraz also contributed, trapping Shamar Joseph lbw shortly after lunch. Rana and Taskin&#39;s aggressive bowling, combined with Hasan Mahmud&rsquo;s efforts, saw West Indies crumble. Mahmud took two quick wickets, dismissing Joshua Da Silva lbw and Keacy Carty caught behind in successive deliveries.<\/p>\r\n\r\n<p>Rana then wrapped up the innings with the removal of Alzarri Joseph and Roach, completing his five-wicket haul and giving Bangladesh a slender 18-run lead. West Indies were bowled out for just 146 in 50.4 overs.<\/p>\r\n\r\n<p>Before Bangladesh&#39;s second innings began, umpires Kumar Dharmasena and Asif Yaqoob intervened to address some ongoing tensions between the fielders and Bangladesh&rsquo;s batsmen. Jayden Seales was particularly vocal, engaging with the Bangladesh players before dismissing Mahmudul Hasan Joy for a duck.<\/p>\r\n\r\n<p>Shahadat Hossain, promoted to number 3, gave Bangladesh the perfect start with some aggressive strokes, though he was dismissed for 28 after a loose shot, caught by Seales at mid-off. However, the momentum continued with a blistering display of batting from Shadman Islam and Mehidy, who smashed boundaries off West Indies&#39; bowlers. Mehidy hit four fours in a row off Shamar, while Shadman contributed with three pull shots in one over. The duo scored 70 runs for the third wicket before Shadman fell for 46 off 82 balls, edging Shamar for the second time in the match.<\/p>\r\n\r\n<p>Mehidy followed shortly after, caught down the leg side for 42 off 39 balls. Litton Das and Jaker Ali then took over, hitting boundaries off Seales and Shamar. Despite a dropped chance by wicketkeeper Da Silva, Litton was dismissed for 25 after missing an offcutter from Justin Greaves.<\/p>\r\n\r\n<p>Jaker Ali, however, remained firm, leading Bangladesh past a 200-run lead as the West Indies struggled to contain the visitors without Roach&#39;s full involvement. Bangladesh ended the day with a strong position, putting up a fight against West Indies&#39; bouncers and increasing their lead.<\/p>\r\n\r\n<p>Bangladesh will now look to capitalize on their advantage and push towards a memorable win in the Jamaica Test.<\/p>\r\n"
            ],
            "pub_date": "03 Dec, 2024 | 10:31 AM",
            "news_id": 1488
        },
        {
            "title": "Kohler-Cadmore's Explosive Fifty Guides Deccan Gladiators to Abu Dhabi T10 Title",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/302437343_news.webp",
            "description": "Tom Kohler-Cadmore’s explosive unbeaten 56 off 21 balls and Nicholas Pooran’s quickfire 28 off 10 led Deccan...",
            "content": [
                "<p>Tom Kohler-Cadmore&rsquo;s explosive unbeaten 56 off 21 balls and Nicholas Pooran&rsquo;s quickfire 28 off 10 led Deccan Gladiators to their second Abu Dhabi T10 title in three years, as they comfortably defeated Morrisville Samp Army by eight wickets in the final.<\/p>\r\n\r\n<p>After winning the toss and opting to field, the Gladiators made sure Samp Army never gained any significant momentum. Maheesh Theekshana struck early, dismissing Sharjeel Khan for just 5 runs, before Charith Asalanka was run out. Andries Gous (21 off 9) and Faf du Plessis (34 off 23) added a 37-run partnership in just 16 balls, giving Samp Army a brief lift. However, the Gladiators hit back, taking four wickets for just six runs in 11 balls to restrict Samp Army&rsquo;s progress. Karim Janat&rsquo;s unbeaten 16 from eight balls took Samp Army to a modest 104\/7, a score that was well below par for this format. Richard Gleeson was the pick of the Gladiators&#39; bowlers, finishing with 2 for 16 in his two overs.<\/p>\r\n\r\n<p>In response, Kohler-Cadmore wasted no time in setting the tone, hammering Rohan Mustafa for four consecutive boundaries in the first over. Pooran joined the charge, launching Amir Hamza for a six, followed by two sixes and a four off Imad Wasim in the third over. By the end of the third over, Gladiators had already reached 50 runs.<\/p>\r\n\r\n<p>Isuru Udana managed to remove Pooran, but Rilee Rossouw quickly regained control, hitting three boundaries off his first four balls. Kohler-Cadmore then took over, blasting Qais Ahmed for three sixes and a four in the fifth over, which went for 25 runs, bringing the Gladiators to the brink of victory.<\/p>\r\n\r\n<p>Kohler-Cadmore brought up his half-century off just 17 balls, before Hamza dismissed Rossouw for 12. Jos Buttler then sealed the win with a six off Qais, and the Gladiators completed the chase in just 6.5 overs, reaching 105\/2. Kohler-Cadmore finished as the tournament&rsquo;s highest run-scorer with 278 runs in nine innings at a striking rate of 198.57, including three half-centuries.<\/p>\r\n"
            ],
            "pub_date": "03 Dec, 2024 | 10:01 AM",
            "news_id": 1487
        },
        {
            "title": "Greaves, Jangoo Called Up for West Indies' ODIs Against Bangladesh",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1930917352_news.webp",
            "description": "Wicketkeeper-batter Amir Jangoo has earned his first call-up to the West Indies ODI squad for the upcoming...",
            "content": [
                "<p>Wicketkeeper-batter Amir Jangoo has earned his first call-up to the West Indies ODI squad for the upcoming three-match series against Bangladesh. Allrounder Justin Greaves also returns to the ODI setup after missing out on the home series against England earlier in November.<\/p>\r\n\r\n<p>Both Jangoo and Greaves were selected due to their standout performances in the recent Super50 ODI tournament, which concluded last month under unusual circumstances. The tournament&#39;s final was forfeited by the two finalists, Barbados Pride and Jamaica Scorpions, who chose not to attend the toss.<\/p>\r\n\r\n<p>Jangoo, representing Trinidad &amp; Tobago, was the tournament&#39;s top scorer, amassing 446 runs in seven innings at an average of 89.20, including three half-centuries and one century. Greaves, who played five innings, finished second on the run-scoring list with 401 runs at an impressive average of 133.66, which included three consecutive centuries. Greaves also scored his maiden Test century last week against Bangladesh, contributing to the West Indies&#39; 201-run win in the opening match.<\/p>\r\n\r\n<p>West Indies head coach Daren Sammy praised the duo, stating, &quot;Greaves is capable of batting anywhere in the top six and brings valuable all-round ability to the squad. Jangoo&rsquo;s success in the CG United Super50 highlights his flexibility and adds another dimension to our batting unit.&quot;<\/p>\r\n\r\n<p>The squad sees the exclusion of Hayden Walsh and Jewel Andrew, who were part of the team that won the recent 2-1 ODI series against England. Andrew will join a group of emerging regional batters who will travel to India for a batting camp at the Chennai Academy, focusing on playing in spinning conditions.<\/p>\r\n\r\n<p>Sammy emphasized the long-term goal of building towards the Men&rsquo;s 50-over World Cup, while also aiming to win series, especially at home, and maintaining momentum from their recent success against England.<\/p>\r\n\r\n<p>The rest of the squad remains largely unchanged, with captain Shai Hope and vice-captain Brandon King leading the batting lineup. The squad also includes Evin Lewis, Shimron Hetmyer, Sherfane Rutherford, Keacy Carty, and Roston Chase. Alzarri Joseph and Shamar Joseph will lead the fast-bowling unit, supported by Jayden Seales and Matthew Forde, while Gudakesh Motie will spearhead the spin bowling department.<\/p>\r\n\r\n<p>The three-match ODI series against Bangladesh will take place in Basseterre on December 8, 10, and 12. This will be followed by a three-match T20I series starting December 16 in Kingstown.<\/p>\r\n\r\n<p><strong>West Indies ODI Squad for Bangladesh Series:<\/strong><\/p>\r\n\r\n<ul>\r\n\t<li><strong>Shai Hope<\/strong> (captain)<\/li>\r\n\t<li><strong>Brandon King<\/strong> (vice-captain)<\/li>\r\n\t<li><strong>Keacy Carty<\/strong><\/li>\r\n\t<li><strong>Roston Chase<\/strong><\/li>\r\n\t<li><strong>Matthew Forde<\/strong><\/li>\r\n\t<li><strong>Justin Greaves<\/strong><\/li>\r\n\t<li><strong>Shimron Hetmyer<\/strong><\/li>\r\n\t<li><strong>Amir Jangoo<\/strong> (wicketkeeper)<\/li>\r\n\t<li><strong>Alzarri Joseph<\/strong><\/li>\r\n\t<li><strong>Shamar Joseph<\/strong><\/li>\r\n\t<li><strong>Evin Lewis<\/strong><\/li>\r\n\t<li><strong>Gudakesh Motie<\/strong><\/li>\r\n\t<li><strong>Sherfane Rutherford<\/strong><\/li>\r\n\t<li><strong>Jayden Seales<\/strong><\/li>\r\n\t<li><strong>Romario Shepherd<\/strong><\/li>\r\n<\/ul>\r\n"
            ],
            "pub_date": "03 Dec, 2024 | 09:59 AM",
            "news_id": 1486
        },
        {
            "title": "Saurashtra Dominates, Karnataka Thrashes Tamil Nadu, Punjab Keeps Hopes Alive in Syed Mushtaq Ali Trophy",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1157612415_news.webp",
            "description": "Saurashtra registered a massive 78-run victory over Group B leaders Baroda, posting a total of 266 for 6...",
            "content": [
                "<p>Saurashtra registered a massive 78-run victory over Group B leaders Baroda, posting a total of 266 for 6, the second-highest score in the history of the Syed Mushtaq Ali Trophy. This impressive win, their fourth in five matches, pushed Saurashtra to second place in the points table, with the top three teams&mdash;Baroda, Saurashtra, and Gujarat&mdash;now separated only by net run rate.<\/p>\r\n\r\n<p><strong>Saurashtra&rsquo;s Explosive Batting Performance<\/strong><\/p>\r\n\r\n<p>Saurashtra&rsquo;s attack was spearheaded by Harvik Desai, the wicketkeeper-batsman, who set the tone early with a blistering 39-ball 76. There were also key contributions from opener Tarang Goel, who smashed a quick 40 off 15 balls, and Jay Gohil, who made an explosive 53 off just 18 balls at No. 6. The Baroda attack, missing their star bowler Hardik Pandya, could not contain the onslaught, despite some resistance in the chase.<\/p>\r\n\r\n<p>Baroda&rsquo;s chase faltered early, as they found themselves struggling at 29 for 3 inside the powerplay. Despite a valiant effort, finishing at 188 for 8, Baroda could not recover enough to overhaul Saurashtra&#39;s massive total, thus maintaining their position at the top of the table.<\/p>\r\n\r\n<p><strong>Karnataka&#39;s Dominant Display Sends Tamil Nadu Packing<\/strong><\/p>\r\n\r\n<p>In another thrilling encounter, Karnataka&#39;s quick bowler Vasuki Koushik capitalized on early morning conditions in Indore to demolish Tamil Nadu&rsquo;s top order. Koushik took three wickets in his first two overs, reducing Tamil Nadu to a dire 7 for 4. Tamil Nadu were bowled out for a paltry 90, and Karnataka, aided by Manish Pandey&rsquo;s steady 42, chased down the target in just 11.3 overs, securing a commanding victory.<\/p>\r\n\r\n<p>This defeat effectively ended Tamil Nadu&rsquo;s hopes of progressing, marking the end of an era for the team that had dominated the competition in recent years, winning back-to-back titles in 2020-21 and 2021-22.<\/p>\r\n\r\n<p><strong>Punjab Keeps Knockout Hopes Alive with Narrow Win Over Hyderabad<\/strong><\/p>\r\n\r\n<p>Punjab kept their slim knockout hopes alive with a dramatic seven-run win over Hyderabad. The match was a tense affair, with Punjab setting a competitive target of 196 for 6, thanks to valuable knocks from Anmolpreet Singh (60) and Ramandeep Singh (39 not out off 11 balls). Hyderabad, despite a late flurry from Chama Milind, who struck 55 off 22 balls, fell short, finishing at 189.<\/p>\r\n\r\n<p>Punjab&#39;s win was largely due to a brilliant five-wicket haul from Naman Dhir, who picked up his first-ever T20 five-wicket haul. Despite Hyderabad&#39;s captain Tilak Varma&rsquo;s modest contribution of 9 runs off 9 balls, Punjab&rsquo;s bowlers, led by Arshdeep Singh, sealed the game in the final stages.<\/p>\r\n\r\n<p><strong>Andhra Continue Unbeaten Run, Edge Out Services<\/strong><\/p>\r\n\r\n<p>Andhra, remaining unbeaten in their last four matches, are now well in the hunt for a knockout spot. On Sunday, they posted a formidable total of 222 for 8 against Services, securing a 23-run victory. The team was led by an explosive partnership between KS Bharat and Ricky Bhui. Bharat scored 63 off 39 balls, while Bhui blasted 84 off just 35 balls, including five sixes.<\/p>\r\n\r\n<p>Services fought valiantly with captain Mohit Ahlawat contributing a strong 74 off 37 balls. However, Cheepurapalli Stephen&rsquo;s impressive bowling performance (3 for 26) restricted them to 199, ensuring Andhra&rsquo;s win.<\/p>\r\n\r\n<p><strong>Looking Ahead<\/strong><\/p>\r\n\r\n<p>With the tournament heating up, the top of the points table remains highly competitive, with Gujarat, Saurashtra, and Baroda all battling for top honors. Tamil Nadu&rsquo;s elimination marks a significant shift in the group&rsquo;s dynamics, while Punjab and Andhra continue to fight for a place in the knockout stages, promising exciting encounters in the coming days.<\/p>\r\n"
            ],
            "pub_date": "02 Dec, 2024 | 02:52 PM",
            "news_id": 1485
        },
        {
            "title": "Hayley Matthews Leads Melbourne Renegades to Maiden WBBL Title",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1446384921_news.webp",
            "description": "Hayley Matthews delivered an outstanding all-round performance to help the Melbourne Renegades clinch their first-ever WBBL title in a thrilling rain-affected final...",
            "content": [
                "<p>Hayley Matthews delivered an outstanding all-round performance to help the Melbourne Renegades clinch their first-ever WBBL title in a thrilling rain-affected final against Brisbane Heat at the MCG. Matthews scored 69 off 61 balls, took 2 wickets for 24, and took a crucial catch, continuing her remarkable record in T20 finals. This victory came just a season after the Renegades finished last in the competition. Brisbane Heat, who had lost last year&#39;s final by three runs, suffered more heartbreak.<\/p>\r\n\r\n<p><strong>Heat&rsquo;s Sloppy Fielding and Renegades&rsquo; Recovery<\/strong><\/p>\r\n\r\n<p>Heat&#39;s poor fielding allowed the Renegades to post 141 for 9, when they could have restricted them to just 76 for 5 after 12 overs. A top-order collapse, combined with a rain delay, left Heat needing 61 runs from 30 balls with five wickets in hand. Jess Jonassen fought valiantly, scoring 44 not out from 28 balls, but Heat could not recover. Renegades&#39; bowlers contributed across the board, with Wareham being the most economical, conceding just 12 runs from two overs.<\/p>\r\n\r\n<p><strong>Renegades&#39; Rocky Start and Matthews&rsquo; Composure<\/strong><\/p>\r\n\r\n<p>After a long wait between matches, the Renegades showed early rust. Courtney Webb was dismissed cheaply, and Sophie Molineux followed suit. Deandra Dottin was run out without facing a ball, leaving the Renegades struggling at 23 for 3 in the fifth over. Despite this, Matthews stayed calm and gradually regained her rhythm, hitting two boundaries in the sixth over. She formed a crucial 41-run partnership with Wareham (21 off 21 balls), whose dismissal left Renegades at 64 for 5 after 12 overs.<\/p>\r\n\r\n<p>Matthews took charge, hitting three boundaries in the power surge off Shikha Pandey. Despite the challenges, Renegades posted 141 for 9, with Matthews continuing to deliver in the last few overs.<\/p>\r\n\r\n<p><strong>Heat&rsquo;s Poor Start and Rain Disruption<\/strong><\/p>\r\n\r\n<p>In the chase, Brisbane Heat suffered an early blow when Grace Harris was dismissed for a duck on the second ball. Jemimah Rodrigues followed with a cheap dismissal, leaving Heat at 11 for 2. A rain shower interrupted play after 3.2 overs, reducing the chase to 98 runs from 12 overs under the Duckworth-Lewis-Stern method. With only eight wickets in hand and one power surge remaining, the Heat&#39;s chances looked slim.<\/p>\r\n\r\n<p><strong>Renegades Dominate with Spin After the Rain<\/strong><\/p>\r\n\r\n<p>After the rain delay, the Renegades&rsquo; spin bowlers took control. Molineux claimed the key wicket of Georgia Redmayne, while Matthews took two wickets in two balls, including Laura Harris for a duck, leaving Heat at 37 for 5. Heat still needed 61 runs from 30 balls.<\/p>\r\n\r\n<p><strong>Jonassen Almost Pulls Off a Miracle<\/strong><\/p>\r\n\r\n<p>Jonassen fought hard, hitting boundaries to keep Heat in the game. With 43 needed from 18 balls, she opted for the power surge. Molineux&#39;s decision to bowl pace allowed Dottin to concede 10 runs in two balls, bringing the required rate down. But a mistake by Lauren Winfield-Hill, who denied Jonassen a second run, led to her dismissal for 3. With 30 runs needed from 12 balls, Matthews bowled two full deliveries, but Heat was unable to sustain the pressure. Molineux returned to bowl the final over, conceding just 11 runs, including a consolation six off the last ball, and sealed the Renegades&#39; first WBBL title.<\/p>\r\n"
            ],
            "pub_date": "01 Dec, 2024 | 06:24 PM",
            "news_id": 1484
        },
        {
            "title": "Former Australia opener Ian Redpath dies aged 83",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/2090323087_news.webp",
            "description": "Ian Redpath, the former Australia batter, has passed away at the age of 83. Known for his resolute style...",
            "content": [
                "<p>Ian Redpath, the former Australia batter, has passed away at the age of 83. Known for his resolute style as an opening batsman, Redpath played 66 Tests and five One-Day Internationals (ODIs) for Australia between 1964 and 1976.<\/p>\r\n\r\n<p>Redpath made an impressive debut, coming close to a century in his first Test match against South Africa at the MCG in 1964. He was dismissed for 97 by Joe Partridge. Reflecting on that moment years later, Redpath recalled the shot he played just before his dismissal: &ldquo;I hit an off-drive for four and there was another one I thought was in the same spot, and I licked my chops. Beautiful follow-through, it was.&quot;<\/p>\r\n\r\n<p>It wasn&#39;t until February 1969, however, that Redpath scored his maiden Test century, making 132 against the West Indies at the SCG. He faced some of the toughest bowlers of the era, including Wes Hall, Charlie Griffith, Garry Sobers, and Lance Gibbs. Throughout his career, Redpath went on to score seven more centuries, with a career-best 171 against England at Perth in 1970. He also finished his Test career with three centuries in four innings against the West Indies in 1975-76.<\/p>\r\n\r\n<p>Despite still being in strong form, Redpath retired from Test cricket in the mid-1970s to focus on his antique business in Geelong. A year later, he was drawn back to the game by the opportunity to play for World Series Cricket, where he spent two seasons, although injuries kept him out for much of his first year.<\/p>\r\n\r\n<p>In a tribute piece, cricket writer Gideon Haigh described Redpath as a hard-to-dismiss batsman, noting his technique: &quot;He knew where his off stump was; he played straight, with a short pick-up, mainly off the back foot; he was a swayer and a ducker of bouncers rather than a hooker in those pre-helmet days.&quot;<\/p>\r\n\r\n<p>Redpath had an illustrious career off the field too. He was the last Australian to play as an amateur, refusing his match fee in the 1963-64 season in order to maintain his amateur status as an Australian Rules Footballer. He also served as vice-captain to both Ian and Greg Chappell and was part of the opening partnership when Greg made his debut century against England in 1970-71. Greg Chappell later praised Redpath for the valuable lessons in Test match batting he learned during their partnership.<\/p>\r\n\r\n<p>Redpath also holds the record for the most runs scored off an over by an Australian, having taken 32 (four sixes and two fours) off Neil Rosendorff during a match against Orange Free State in 1969-70. Notably, his first six in international cricket came in his penultimate Test match against the West Indies.<\/p>\r\n\r\n<p>Redpath&rsquo;s contributions were widely recognized. In 1975, he was awarded an MBE, and in 2023, he was inducted into the Cricket Australia Hall of Fame. The Geelong Cricket Club also renamed their scoreboard in his honor in 2024.<\/p>\r\n\r\n<p>Cricket Australia&rsquo;s chairman Mike Baird expressed deep sorrow at his passing, calling him a &ldquo;much loved and revered figure&rdquo; and noting his significant contributions both on and off the field. Cricket Victoria chair Ross Hepburn echoed these sentiments, highlighting Redpath&#39;s enduring legacy in Australian cricket and his character as a gifted storyteller with a sharp sense of humor. Redpath leaves behind a remarkable legacy and is fondly remembered by the cricket community.<\/p>\r\n"
            ],
            "pub_date": "01 Dec, 2024 | 11:00 AM",
            "news_id": 1483
        },
        {
            "title": "Ben Stokes downplays injury concern after halting over due to back pain",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/2096772553_news.webp",
            "description": "Ben Stokes experienced an injury scare on day four of the first Test against New Zealand when he aborted a spell...",
            "content": [
                "<p>Ben Stokes experienced an injury scare on day four of the first Test against New Zealand when he aborted a spell in the middle of his fifth over, citing soreness in his back. However, he dismissed the incident as &quot;more management than anything else&quot; and stated that he was fit to play in the second Test.<\/p>\r\n\r\n<p>The England Test captain opened the bowling on Sunday in Christchurch, with his team trailing by four runs but needing just four more wickets in New Zealand&rsquo;s second innings. Stokes appeared unaffected during his first four overs from the Botanical Gardens End but was forced to step away after three deliveries of his fifth over. His 19.3 overs in the match marked the most he had bowled in a Test since December 2022, when he bowled 27 overs against Pakistan in Rawalpindi.<\/p>\r\n\r\n<p>The issue seemed to be precautionary, likely caused by stiffness in his lower back. Rather than risk further injury, Stokes chose to withdraw from the over, with Gus Atkinson stepping in to complete it. Stokes remained on the field through lunch, and New Zealand was dismissed for 254, with Brydon Carse taking 6 for 42. England then needed just 104 runs to win, which they achieved in 12.4 overs.<\/p>\r\n\r\n<p>In the post-match presentation, Stokes downplayed the injury and declared himself fit for the second Test in Wellington, starting on Friday. &quot;I&#39;ve not spent that much time out in the middle for a long time,&quot; he said. &quot;It&#39;s been a pretty heavy week: a lot of time in the field, bowled 20 overs, and spent some time out in the middle.&quot;<\/p>\r\n\r\n<p>He also revealed the back issue occurred while fielding, adding, &quot;I hurt my back diving for a ball as well. It&#39;s more management than anything else. Given the state of the game, it didn&rsquo;t seem necessary to bowl any more than I needed to. I think the body will be good for the next match, and I&rsquo;m ready to go for Wellington.&quot;<\/p>\r\n\r\n<p>Stokes had knee surgery last November to address a long-standing problem and withdrew from this year&#39;s T20 World Cup to focus on his return to bowling. After taking five wickets against the West Indies in his comeback series and surpassing 200 Test wickets, he tore his hamstring during the Hundred, which kept him out of four Tests.<\/p>\r\n\r\n<p>Ahead of the first Test against New Zealand, Stokes declared himself &quot;good as gold&quot; and fully recovered from the hamstring injury. He also confirmed that he had opted out of the IPL mega-auction to prioritize his physical well-being and prolong his career.<\/p>\r\n"
            ],
            "pub_date": "01 Dec, 2024 | 10:56 AM",
            "news_id": 1482
        },
        {
            "title": "Josh Hazlewood Ruled Out of Second Test; Abbott and Doggett Added to Australia Squad",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/135780719_news.webp",
            "description": "Josh Hazlewood has been ruled out of the second Test against India due to a side strain....",
            "content": [
                "<p>Josh Hazlewood has been ruled out of the second Test against India due to a side strain. In his absence, uncapped fast bowlers Sean Abbott and Brendan Doggett have been added to Australia&#39;s squad. However, Scott Boland is expected to replace Hazlewood in the XI for the day-night Test.<\/p>\r\n\r\n<p>Cricket Australia confirmed Hazlewood is dealing with a &quot;low-grade left side injury&quot; and will remain with the squad in Adelaide to focus on his recovery. Hazlewood was Australia&#39;s standout bowler in the first Test in Perth, claiming 5 for 57 across 34 overs. This will be the first Test he has missed since the 2023 Ashes series at Headingley, after a run of injuries&mdash;including two side strains&mdash;and some omissions for subcontinent tours. Between December 2021 and June 2023, Hazlewood played just four Tests.<\/p>\r\n\r\n<p>If, as expected, Boland is called up to replace Hazlewood, it will mark his first Test since coming in for Hazlewood during last year&#39;s Ashes at Leeds. Boland has an exceptional home record, taking 28 wickets at 12.21 from six Tests.<\/p>\r\n\r\n<p>Australia&rsquo;s attack remained unchanged for the seven Tests played last season against Pakistan, West Indies, and New Zealand. The Perth Test was the 10th consecutive outing where Hazlewood, Pat Cummins, and Mitchell Starc lined up together.<\/p>\r\n\r\n<p>Abbott, who is a regular in Australia&#39;s white-ball squads, has long been seen as unlucky not to earn a Test debut. Doggett, on the other hand, has made a rapid return to national contention after being part of the 2018 Pakistan series in the UAE. His recent form includes a career-best 6 for 15 for Australia A against India A in Mackay, after initially being called up as an injury replacement.<\/p>\r\n\r\n<p>Michael Neser, who would have been a strong contender for a call-up, is sidelined with a hamstring injury sustained during the second Australia A match at the MCG and is unlikely to be fit for the Test until the BBL begins.<\/p>\r\n\r\n<p>Meanwhile, Western Australia&rsquo;s Jhye Richardson and Lance Morris, both centrally contracted, have made their returns to Sheffield Shield cricket after injuries.<\/p>\r\n\r\n<p>Australia had also added uncapped allrounder Beau Webster to the squad following concerns over Mitchell Marsh, who felt soreness after the Perth Test. Josh Inglis, initially selected as a backup batter, remains in the squad but could be replaced by Webster if Marsh is unavailable for Adelaide.<\/p>\r\n\r\n<p>The absence of Hazlewood adds to Australia&rsquo;s uncertainty ahead of the second Test, especially after their heavy 295-run defeat in Perth. Questions remain over the batting lineup, particularly with Marnus Labuschagne under pressure after failing twice in Perth, including a duck in the first innings.<\/p>\r\n\r\n<p>Australia&rsquo;s squad will begin training in Adelaide a day earlier than planned, on Monday. India, meanwhile, are set to play a two-day practice match against the Prime Minister&rsquo;s XI in Canberra, though heavy rain may affect the fixture. Boland is also part of the PM&rsquo;s XI to get some match practice, having played just two first-class games this season.<\/p>\r\n"
            ],
            "pub_date": "30 Nov, 2024 | 09:46 AM",
            "news_id": 1481
        },
        {
            "title": "Heather Knight Signs with Somerset Ahead of Tier 1 Women's County Cricket",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/1868729913_news.webp",
            "description": "England women's cricket captain, Heather Knight, has joined Somerset ahead of the launch of Tier 1 professional women's....",
            "content": [
                "<p>England women&#39;s cricket captain, Heather Knight, has joined Somerset ahead of the launch of Tier 1 professional women&#39;s county cricket next summer. This move comes after Knight&rsquo;s tenure with Berkshire, where she began her career, and her time as captain of Western Storm, leading them to two Kia Super League titles in the regional system. Earlier this year, Knight was also appointed to the Somerset board in an advisory capacity.<\/p>\r\n\r\n<p>Knight&#39;s signing follows recent moves by England players Charlie Dean and Danielle Gibson, her former Western Storm teammate. All three, who are centrally contracted to England, will play for Somerset whenever their international commitments allow.<\/p>\r\n\r\n<p>Knight expressed her excitement about the move, saying, &quot;Somerset is a club that holds a special place in my heart, so I&rsquo;m incredibly excited about this opportunity. The South West has played an integral role in my journey, and it&rsquo;s a privilege to represent the region that means so much to me.&quot;<\/p>\r\n\r\n<p>She also spoke about the opportunity to help build something special with Somerset&rsquo;s first professional women&rsquo;s team, stating, &quot;We have a genuine opportunity to create something special... We have a duty to those who have gone before to make sure we are a team that competes and inspires young people across the region.&quot;<\/p>\r\n\r\n<p>Knight, who led England to a World Cup win, has been captain since 2016 and is currently leading the team on their tour of South Africa.<\/p>\r\n\r\n<p>Somerset Women&rsquo;s head coach, Trevor Griffin, expressed his delight, saying, &quot;Heather is a player I&rsquo;ve worked with for many years, and I&rsquo;m delighted she will be playing for Somerset when her England commitments allow. She is a true professional and an invaluable addition to any side.&quot;<\/p>\r\n\r\n<p>Somerset&rsquo;s director of cricket, Andy Hurry, praised Knight&rsquo;s global experience, saying, &quot;Heather is a world-class performer who has shown her quality on the biggest stages... Her experience will have a major impact on the team, the club, and the region. It&rsquo;s an honour to have the England captain committed to the club.&quot;<\/p>\r\n\r\n<p>Knight&rsquo;s arrival is expected to inspire future generations of players and supporters in Somerset.<\/p>\r\n"
            ],
            "pub_date": "30 Nov, 2024 | 09:45 AM",
            "news_id": 1480
        },
        {
            "title": "Bangladesh Seek Improvement as West Indies Eye Rare Test Series Sweep",
            "image": "https:\/\/cricketchampion.co.in\/webroot\/img\/news\/158555604_news.webp",
            "description": "Sabina Park, set to host its first Test in over three years, is a venue West Indies are quite familiar with. With their regular play....",
            "content": [
                "<p>Sabina Park, set to host its first Test in over three years, is a venue West Indies are quite familiar with. With their regular play there across various formats, the hosts are well-positioned to build on a strong performance and secure a 2-0 series win over Bangladesh. If they achieve this, it would mark West Indies&rsquo; first Test series sweep since July 2022, when they also defeated Bangladesh.<\/p>\r\n\r\n<p>West Indies have shown promise, particularly with their batting in the first Test at North Sound. They posted two significant 140-run partnerships&mdash;one between Alick Athanaze and Mikyle Louis, who both fell in the 90s, and another involving Justin Greaves, who scored his first Test century. The middle order was solid, with Greaves receiving key support from Kemar Roach for the eighth-wicket partnership.<\/p>\r\n\r\n<p>Their bowling has also been disciplined, with a four-man pace attack led by Jayden Seales. Shamar Joseph and Alzarri Joseph provided fiery bursts, while Roach brought experience, especially in his dominance over Bangladesh.<\/p>\r\n\r\n<p>On the other hand, Bangladesh&rsquo;s performance has been more about their pace bowling, which was their only positive in the first Test. Taskin Ahmed impressed with eight wickets, including a career-best six-wicket haul in the second innings. Hasan Mahmud and Shoriful Islam were also consistent, and with Nahid Rana potentially being added to the squad, Bangladesh&#39;s pace attack may be further bolstered for the second Test.<\/p>\r\n\r\n<p>However, Bangladesh&rsquo;s batting remains a concern. Despite a patient 98-over effort in their first innings, with fifties from Jaker Ali and Mominul Haque, their batting depth is fragile. Litton Das&rsquo;s 40 was one of the few other positives. Outside of a brief resistance from Mehidy Hasan Miraz and Jaker in the second innings, the batting lineup continues to falter, with Bangladesh having lost their last five Tests since their 2-0 win over Pakistan.<\/p>\r\n\r\n<p>Both teams will need to improve their catching after multiple dropped chances. Mominul dropped two in quick succession, while West Indies missed four during Shamar Joseph&rsquo;s first spell on day four, which marred an otherwise solid game.<\/p>\r\n\r\n<p><strong>Form Guide<\/strong><br \/>\r\nWest Indies: WLDLL (last five Tests)<br \/>\r\nBangladesh: LLLLL<\/p>\r\n\r\n<p>Both teams are no longer in contention for the World Test Championship final.<\/p>\r\n\r\n<p><strong>In the Spotlight: Justin Greaves and Jaker Ali<\/strong><\/p>\r\n\r\n<p>It took Justin Greaves ten years to make his Test debut, only to be dropped after a series in Australia earlier this year. However, he returned to the side and impressed, particularly with his composed batting during a key partnership with Roach. West Indies will expect another strong showing from him in Jamaica.<\/p>\r\n\r\n<p>Jaker Ali, unlike many of his teammates, has shown resilience under pressure. With fifties in his first two Tests, a rare feat for a Bangladesh batter, Jaker has proven to be a fighter. He continues to encourage his teammates, particularly the lower-order batters, and will likely shoulder more responsibility in the upcoming Test.<\/p>\r\n\r\n<p><strong>Team News: Possible Changes for Bangladesh<\/strong><br \/>\r\nWest Indies are expected to keep their XI unchanged unless injuries occur.<br \/>\r\n<strong>West Indies (probable XI):<\/strong><\/p>\r\n\r\n<ol>\r\n\t<li>Kraigg Brathwaite (capt)<\/li>\r\n\t<li>Mikyle Louis<\/li>\r\n\t<li>Keacy Carty<\/li>\r\n\t<li>Alick Athanaze<\/li>\r\n\t<li>Kavem Hodge<\/li>\r\n\t<li>Justin Greaves<\/li>\r\n\t<li>Joshua Da Silva (wk)<\/li>\r\n\t<li>Kemar Roach<\/li>\r\n\t<li>Alzarri Joseph<\/li>\r\n\t<li>Jayden Seales<\/li>\r\n\t<li>Shamar Joseph<\/li>\r\n<\/ol>\r\n\r\n<p>For Bangladesh, changes could come in response to the poor performances of Mahmudul Hasan Joy and Zakir Hasan in the first Test. One or both of Shadman Islam and Mahidul Islam may come into the XI. Nahid Rana could also feature, as Bangladesh tend to rotate their fast bowlers.<\/p>\r\n\r\n<p><strong>Bangladesh (probable XI):<\/strong><\/p>\r\n\r\n<ol>\r\n\t<li>Mahmudul Hasan Joy\/Shadman Islam<\/li>\r\n\t<li>Zakir Hasan\/Mahidul Islam<\/li>\r\n\t<li>Mominul Haque<\/li>\r\n\t<li>Shahadat Hossain<\/li>\r\n\t<li>Mehidy Hasan Miraz (capt)<\/li>\r\n\t<li>Litton Das (wk)<\/li>\r\n\t<li>Jaker Ali<\/li>\r\n\t<li>Taijul Islam<\/li>\r\n\t<li>Hasan Mahmud<\/li>\r\n\t<li>Taskin Ahmed<\/li>\r\n\t<li>Shoriful Islam\/Nahid Rana<\/li>\r\n<\/ol>\r\n\r\n<p><strong>Pitch and Conditions<\/strong><br \/>\r\nSabina Park, while known for producing big scores in T20Is this year, is traditionally a balanced pitch for both fast bowlers and spinners in Test cricket. However, rain is forecast for all five days in Kingston, potentially impacting the match.<\/p>\r\n"
            ],
            "pub_date": "30 Nov, 2024 | 09:43 AM",
            "news_id": 1479
        }
    ]
}